module @jit_jax_calc_wrapper attributes {mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<64xi32>, %arg1: tensor<64x64x3xf32>, %arg2: tensor<64x64xi32>, %arg3: tensor<i32>, %arg4: tensor<f32>) -> (tensor<f32> {jax.result_info = "result[0]"}, tensor<64x3xf32> {jax.result_info = "result[1]"}, tensor<6xf32> {jax.result_info = "result[2]"}) {
    %cst = stablehlo.constant dense<[-2.13442039, -1.42303443]> : tensor<2xf32>
    %cst_0 = stablehlo.constant dense<[-5.50651693, -1.68415856, -3.08951521, 1.02423263, 3.47528768, 2.78716612, 2.03157115, 1.29981482, 2.65568686, 5.32603407, -5.462850e+00, -0.0875505656, 0.071106404, 0.23732692, -1.32929623, -1.72219217, -0.085194543, -0.521280527, -1.82596743, 0.310678154, 0.14799346, -3.70192671, -1.76723862, -0.0515363552, 0.137729079, 0.146934927, 0.119335808, -6.055290e-02, -0.191577688]> : tensor<29xf32>
    %cst_1 = stablehlo.constant dense<[0.158076227, 0.157874137, 0.0786165595, 0.121467963, 0.0386004895, 0.00693756947, -0.0238076057, -9.028900e-03]> : tensor<8xf32>
    %cst_2 = stablehlo.constant dense<[0.207484871, 0.373621613, 0.320314109, 0.223365441, 0.106207252, 0.0826742127, 0.0142681589, 0.0080147814]> : tensor<8xf32>
    %cst_3 = stablehlo.constant dense<[-0.335845172, -0.0979904755, -0.365581691, -0.0728622749, -0.120380893, -0.0533700809, -0.013209017, -0.00967365224]> : tensor<8xf32>
    %cst_4 = stablehlo.constant dense<[0.46890083, 0.00592084322, 0.406803608, 0.25960952, 0.176260978, 0.0420474373, -0.019938346, -0.00362472981]> : tensor<8xf32>
    %cst_5 = stablehlo.constant dense<[0.0366196521, 0.167430401, 0.125902072, 0.102618426, 0.0792881399, 0.0655014962, 0.0276192725, 0.00132603035]> : tensor<8xf32>
    %cst_6 = stablehlo.constant dense<[0.278138459, 0.193185762, -0.0735269636, 0.242082402, 0.387782395, 0.137699738, 0.105480149, -0.00986088905]> : tensor<8xf32>
    %cst_7 = stablehlo.constant dense<[0.235930696, 0.00750631187, 0.192909047, 0.0361860842, 0.037753731, -0.0210961122, -0.0184604116, -0.0196542852]> : tensor<8xf32>
    %cst_8 = stablehlo.constant dense<[-0.305040807, -0.41001004, -0.442647487, -0.202947915, -0.112970009, -0.110911243, -0.0633852109, -0.030109996]> : tensor<8xf32>
    %cst_9 = stablehlo.constant dense<[-0.292062312, -0.0371276215, 0.130894676, -0.134774223, -0.447155118, -0.124483153, -0.0968777909, 0.0276620518]> : tensor<8xf32>
    %cst_10 = stablehlo.constant dense<[0.379155278, 0.0627998784, 0.357896984, 0.185332119, 0.168721333, 0.0514729731, 0.0490280353, 0.0207109842]> : tensor<8xf32>
    %cst_11 = stablehlo.constant dense<[-0.0784524157, -0.123475477, -0.163461342, -0.02092731, 0.0264867935, 0.0409899503, 0.0126694916, 0.00346809067]> : tensor<8xf32>
    %cst_12 = stablehlo.constant dense<[-0.0671107322, -0.017523421, -0.0496234894, -0.0298735239, -7.095200e-02, -0.0271951947, -0.0101533374, -0.0131967496]> : tensor<8xf32>
    %c = stablehlo.constant dense<[0, 4, 8, 5, 2, 1]> : tensor<6xi32>
    %0 = stablehlo.broadcast_in_dim %cst_1, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %1 = stablehlo.broadcast_in_dim %cst_2, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %2 = stablehlo.broadcast_in_dim %cst_3, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %3 = stablehlo.concatenate %0, %1, %2, dim = 0 : (tensor<1x8xf32>, tensor<1x8xf32>, tensor<1x8xf32>) -> tensor<3x8xf32>
    %4 = stablehlo.broadcast_in_dim %cst_4, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %5 = stablehlo.broadcast_in_dim %cst_5, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %6 = stablehlo.broadcast_in_dim %cst_6, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %7 = stablehlo.concatenate %4, %5, %6, dim = 0 : (tensor<1x8xf32>, tensor<1x8xf32>, tensor<1x8xf32>) -> tensor<3x8xf32>
    %8 = stablehlo.broadcast_in_dim %3, dims = [1, 2] : (tensor<3x8xf32>) -> tensor<1x3x8xf32>
    %9 = stablehlo.broadcast_in_dim %7, dims = [1, 2] : (tensor<3x8xf32>) -> tensor<1x3x8xf32>
    %10 = stablehlo.concatenate %8, %9, dim = 0 : (tensor<1x3x8xf32>, tensor<1x3x8xf32>) -> tensor<2x3x8xf32>
    %11 = stablehlo.broadcast_in_dim %cst_7, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %12 = stablehlo.broadcast_in_dim %cst_8, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %13 = stablehlo.broadcast_in_dim %cst_9, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %14 = stablehlo.concatenate %11, %12, %13, dim = 0 : (tensor<1x8xf32>, tensor<1x8xf32>, tensor<1x8xf32>) -> tensor<3x8xf32>
    %15 = stablehlo.broadcast_in_dim %cst_10, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %16 = stablehlo.broadcast_in_dim %cst_11, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %17 = stablehlo.broadcast_in_dim %cst_12, dims = [1] : (tensor<8xf32>) -> tensor<1x8xf32>
    %18 = stablehlo.concatenate %15, %16, %17, dim = 0 : (tensor<1x8xf32>, tensor<1x8xf32>, tensor<1x8xf32>) -> tensor<3x8xf32>
    %19 = stablehlo.broadcast_in_dim %14, dims = [1, 2] : (tensor<3x8xf32>) -> tensor<1x3x8xf32>
    %20 = stablehlo.broadcast_in_dim %18, dims = [1, 2] : (tensor<3x8xf32>) -> tensor<1x3x8xf32>
    %21 = stablehlo.concatenate %19, %20, dim = 0 : (tensor<1x3x8xf32>, tensor<1x3x8xf32>) -> tensor<2x3x8xf32>
    %22 = stablehlo.broadcast_in_dim %10, dims = [1, 2, 3] : (tensor<2x3x8xf32>) -> tensor<1x2x3x8xf32>
    %23 = stablehlo.broadcast_in_dim %21, dims = [1, 2, 3] : (tensor<2x3x8xf32>) -> tensor<1x2x3x8xf32>
    %24 = stablehlo.concatenate %22, %23, dim = 0 : (tensor<1x2x3x8xf32>, tensor<1x2x3x8xf32>) -> tensor<2x2x3x8xf32>
    %cst_13 = stablehlo.constant dense<0.0856752247> : tensor<f32>
    %cst_14 = stablehlo.constant dense<1.81088519> : tensor<f32>
    %cst_15 = stablehlo.constant dense<5.000000e+00> : tensor<f32>
    %25 = call @_jax_calc_local_energy(%arg1, %arg0, %arg2, %cst, %cst_0, %24, %cst_13, %cst_14, %cst_15) : (tensor<64x64x3xf32>, tensor<64xi32>, tensor<64x64xi32>, tensor<2xf32>, tensor<29xf32>, tensor<2x2x3x8xf32>, tensor<f32>, tensor<f32>, tensor<f32>) -> tensor<64xf32>
    %26:12 = call @_jax_calc_local_energy_1(%arg1, %arg0, %arg2, %24, %cst_13, %cst_14, %cst_15) : (tensor<64x64x3xf32>, tensor<64xi32>, tensor<64x64xi32>, tensor<2x2x3x8xf32>, tensor<f32>, tensor<f32>, tensor<f32>) -> (tensor<64x64xf32>, tensor<64x3x64xf32>, tensor<64x64x3x8xf32>, tensor<64x64xf32>, tensor<f32>, tensor<64x64xf32>, tensor<6x64x64xf32>, tensor<64x64xf32>, tensor<64x64x3xf32>, tensor<f32>, tensor<64x64xf32>, tensor<64x64xi1>)
    %27 = stablehlo.iota dim = 0 : tensor<1x1xi32>
    %28 = stablehlo.iota dim = 1 : tensor<1x1xi32>
    %c_16 = stablehlo.constant dense<0> : tensor<i32>
    %29 = stablehlo.broadcast_in_dim %c_16, dims = [] : (tensor<i32>) -> tensor<1x1xi32>
    %30 = stablehlo.add %27, %29 : tensor<1x1xi32>
    %31 = stablehlo.compare  EQ, %30, %28,  SIGNED : (tensor<1x1xi32>, tensor<1x1xi32>) -> tensor<1x1xi1>
    %32 = stablehlo.convert %31 : (tensor<1x1xi1>) -> tensor<1x1xf32>
    %33 = stablehlo.slice %32 [0:1, 0:1] : (tensor<1x1xf32>) -> tensor<1x1xf32>
    %34 = stablehlo.reshape %33 : (tensor<1x1xf32>) -> tensor<1xf32>
    %35 = call @_jax_calc_local_energy_7(%cst_0, %arg1, %26#0, %26#1, %26#2, %26#3, %26#4, %26#5, %26#6, %26#7, %26#8, %26#9, %26#10, %26#11, %34) : (tensor<29xf32>, tensor<64x64x3xf32>, tensor<64x64xf32>, tensor<64x3x64xf32>, tensor<64x64x3x8xf32>, tensor<64x64xf32>, tensor<f32>, tensor<64x64xf32>, tensor<6x64x64xf32>, tensor<64x64xf32>, tensor<64x64x3xf32>, tensor<f32>, tensor<64x64xf32>, tensor<64x64xi1>, tensor<1xf32>) -> tensor<64x1x64x3xf32>
    %36 = stablehlo.slice %35 [0:64, 0:1, 0:64, 0:3] : (tensor<64x1x64x3xf32>) -> tensor<64x1x64x3xf32>
    %37 = stablehlo.reshape %36 : (tensor<64x1x64x3xf32>) -> tensor<64x64x3xf32>
    %38 = stablehlo.broadcast_in_dim %25, dims = [0] : (tensor<64xf32>) -> tensor<64x64xf32>
    %39 = stablehlo.transpose %arg1, dims = [0, 2, 1] : (tensor<64x64x3xf32>) -> tensor<64x3x64xf32>
    %40 = stablehlo.dot_general %39, %37, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3x64xf32>, tensor<64x64x3xf32>) -> tensor<64x3x3xf32>
    %cst_17 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %41 = stablehlo.reduce(%40 init: %cst_17) applies stablehlo.add across dimensions = [0] : (tensor<64x3x3xf32>, tensor<f32>) -> tensor<3x3xf32>
    %c_18 = stablehlo.constant dense<3> : tensor<i32>
    %42 = stablehlo.compare  EQ, %arg3, %c_18,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1>
    %43 = stablehlo.convert %42 : (tensor<i1>) -> tensor<i32>
    %44 = "stablehlo.case"(%43) ({
      %cst_21 = stablehlo.constant dense<0x7FC00000> : tensor<f32>
      %47 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<6xf32>
      stablehlo.return %47 : tensor<6xf32>
    }, {
      %47 = stablehlo.transpose %41, dims = [1, 0] : (tensor<3x3xf32>) -> tensor<3x3xf32>
      %48 = stablehlo.add %41, %47 : tensor<3x3xf32>
      %cst_21 = stablehlo.constant dense<5.000000e-01> : tensor<f32>
      %49 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<3x3xf32>
      %50 = stablehlo.multiply %48, %49 : tensor<3x3xf32>
      %51 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<f32>) -> tensor<3x3xf32>
      %52 = stablehlo.divide %50, %51 : tensor<3x3xf32>
      %53 = stablehlo.reshape %52 : (tensor<3x3xf32>) -> tensor<9xf32>
      %c_22 = stablehlo.constant dense<0> : tensor<i32>
      %54 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i32>) -> tensor<6xi32>
      %55 = stablehlo.compare  LT, %c, %54,  SIGNED : (tensor<6xi32>, tensor<6xi32>) -> tensor<6xi1>
      %c_23 = stablehlo.constant dense<9> : tensor<i32>
      %56 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i32>) -> tensor<6xi32>
      %57 = stablehlo.add %c, %56 : tensor<6xi32>
      %58 = stablehlo.select %55, %57, %c : tensor<6xi1>, tensor<6xi32>
      %59 = stablehlo.broadcast_in_dim %58, dims = [0] : (tensor<6xi32>) -> tensor<6x1xi32>
      %60 = "stablehlo.gather"(%53, %59) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = array<i64: 1>}> : (tensor<9xf32>, tensor<6x1xi32>) -> tensor<6xf32>
      stablehlo.return %60 : tensor<6xf32>
    }) : (tensor<i32>) -> tensor<6xf32>
    %cst_19 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %45 = stablehlo.reduce(%37 init: %cst_19) applies stablehlo.add across dimensions = [1] : (tensor<64x64x3xf32>, tensor<f32>) -> tensor<64x3xf32>
    %cst_20 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %46 = stablehlo.reduce(%38 init: %cst_20) applies stablehlo.add across dimensions = [0, 1] : (tensor<64x64xf32>, tensor<f32>) -> tensor<f32>
    return %46, %45, %44 : tensor<f32>, tensor<64x3xf32>, tensor<6xf32>
  }
  func.func private @_jax_calc_local_energy(%arg0: tensor<64x64x3xf32>, %arg1: tensor<64xi32>, %arg2: tensor<64x64xi32>, %arg3: tensor<2xf32>, %arg4: tensor<29xf32>, %arg5: tensor<2x2x3x8xf32>, %arg6: tensor<f32>, %arg7: tensor<f32>, %arg8: tensor<f32>) -> tensor<64xf32> {
    %0 = call @norm(%arg0) : (tensor<64x64x3xf32>) -> tensor<64x64xf32>
    %cst = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %1 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %2 = stablehlo.multiply %1, %0 : tensor<64x64xf32>
    %3 = stablehlo.add %arg7, %arg8 : tensor<f32>
    %4 = stablehlo.convert %3 : tensor<f32>
    %5 = stablehlo.broadcast_in_dim %4, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %6 = stablehlo.subtract %2, %5 : tensor<64x64xf32>
    %7 = stablehlo.subtract %arg8, %arg7 : tensor<f32>
    %8 = stablehlo.convert %7 : tensor<f32>
    %9 = stablehlo.broadcast_in_dim %8, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %10 = stablehlo.divide %6, %9 : tensor<64x64xf32>
    %cst_0 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %11 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<64xf32>
    %12 = stablehlo.broadcast_in_dim %11, dims = [1] : (tensor<64xf32>) -> tensor<64x64xf32>
    %cst_1 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %13 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<6x64x64xf32>
    %c = stablehlo.constant dense<0> : tensor<i32>
    %14:5 = stablehlo.while(%iterArg = %10, %iterArg_6 = %c, %iterArg_7 = %12, %iterArg_8 = %10, %iterArg_9 = %13) : tensor<64x64xf32>, tensor<i32>, tensor<64x64xf32>, tensor<64x64xf32>, tensor<6x64x64xf32>
     cond {
      %c_10 = stablehlo.constant dense<6> : tensor<i32>
      %275 = stablehlo.compare  LT, %iterArg_6, %c_10,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1>
      stablehlo.return %275 : tensor<i1>
    } do {
      %275:3 = func.call @None(%iterArg, %iterArg_7, %iterArg_8) : (tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>) -> (tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>)
      %276 = stablehlo.broadcast_in_dim %275#2, dims = [1, 2] : (tensor<64x64xf32>) -> tensor<1x64x64xf32>
      %c_10 = stablehlo.constant dense<0> : tensor<i32>
      %277 = stablehlo.dynamic_update_slice %iterArg_9, %276, %iterArg_6, %c_10, %c_10 : (tensor<6x64x64xf32>, tensor<1x64x64xf32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<6x64x64xf32>
      %c_11 = stablehlo.constant dense<1> : tensor<i32>
      %278 = stablehlo.add %iterArg_6, %c_11 : tensor<i32>
      stablehlo.return %iterArg, %278, %275#0, %275#1, %277 : tensor<64x64xf32>, tensor<i32>, tensor<64x64xf32>, tensor<64x64xf32>, tensor<6x64x64xf32>
    }
    %15 = stablehlo.slice %14#4 [0:1, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %16 = stablehlo.transpose %15, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %17 = stablehlo.reshape %16 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %18 = stablehlo.slice %14#4 [1:2, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %19 = stablehlo.transpose %18, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %20 = stablehlo.reshape %19 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %21 = stablehlo.slice %14#4 [2:3, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %22 = stablehlo.transpose %21, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %23 = stablehlo.reshape %22 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %24 = stablehlo.slice %14#4 [3:4, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %25 = stablehlo.transpose %24, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %26 = stablehlo.reshape %25 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %27 = stablehlo.slice %14#4 [4:5, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %28 = stablehlo.transpose %27, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %29 = stablehlo.reshape %28 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %30 = stablehlo.slice %14#4 [5:6, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %31 = stablehlo.transpose %30, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %32 = stablehlo.reshape %31 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %33 = call @atleast_2d(%11) : (tensor<64xf32>) -> tensor<1x64xf32>
    %34 = stablehlo.transpose %33, dims = [1, 0] : (tensor<1x64xf32>) -> tensor<64x1xf32>
    %35 = call @atleast_2d_0(%10) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %36 = stablehlo.transpose %35, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %37 = call @atleast_2d_0(%17) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %38 = stablehlo.transpose %37, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %39 = call @atleast_2d_0(%20) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %40 = stablehlo.transpose %39, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %41 = call @atleast_2d_0(%23) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %42 = stablehlo.transpose %41, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %43 = call @atleast_2d_0(%26) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %44 = stablehlo.transpose %43, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %45 = call @atleast_2d_0(%29) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %46 = stablehlo.transpose %45, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %47 = call @atleast_2d_0(%32) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %48 = stablehlo.transpose %47, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %49 = stablehlo.broadcast_in_dim %34, dims = [1, 2] : (tensor<64x1xf32>) -> tensor<64x64x1xf32>
    %50 = stablehlo.concatenate %49, %36, %38, %40, %42, %44, %46, %48, dim = 2 : (tensor<64x64x1xf32>, tensor<64x64x1xf32>, tensor<64x64x1xf32>, tensor<64x64x1xf32>, tensor<64x64x1xf32>, tensor<64x64x1xf32>, tensor<64x64x1xf32>, tensor<64x64x1xf32>) -> tensor<64x64x8xf32>
    %51 = stablehlo.convert %arg8 : tensor<f32>
    %52 = stablehlo.broadcast_in_dim %51, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %53 = stablehlo.compare  LT, %0, %52,  FLOAT : (tensor<64x64xf32>, tensor<64x64xf32>) -> tensor<64x64xi1>
    %54 = stablehlo.convert %arg8 : tensor<f32>
    %55 = stablehlo.broadcast_in_dim %54, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %56 = stablehlo.subtract %55, %0 : tensor<64x64xf32>
    %57 = stablehlo.multiply %56, %56 : tensor<64x64xf32>
    %c_2 = stablehlo.constant dense<0> : tensor<i32>
    %58 = call @_where(%53, %57, %c_2) : (tensor<64x64xi1>, tensor<64x64xf32>, tensor<i32>) -> tensor<64x64xf32>
    %59 = stablehlo.convert %arg6 : tensor<f32>
    %60 = stablehlo.broadcast_in_dim %59, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %61 = stablehlo.multiply %60, %58 : tensor<64x64xf32>
    %c_3 = stablehlo.constant dense<0> : tensor<i32>
    %62 = stablehlo.broadcast_in_dim %c_3, dims = [] : (tensor<i32>) -> tensor<64xi32>
    %63 = stablehlo.compare  LT, %arg1, %62,  SIGNED : (tensor<64xi32>, tensor<64xi32>) -> tensor<64xi1>
    %c_4 = stablehlo.constant dense<2> : tensor<i32>
    %64 = stablehlo.broadcast_in_dim %c_4, dims = [] : (tensor<i32>) -> tensor<64xi32>
    %65 = stablehlo.add %arg1, %64 : tensor<64xi32>
    %66 = stablehlo.select %63, %65, %arg1 : tensor<64xi1>, tensor<64xi32>
    %67 = stablehlo.broadcast_in_dim %c_3, dims = [] : (tensor<i32>) -> tensor<64x64xi32>
    %68 = stablehlo.compare  LT, %arg2, %67,  SIGNED : (tensor<64x64xi32>, tensor<64x64xi32>) -> tensor<64x64xi1>
    %69 = stablehlo.broadcast_in_dim %c_4, dims = [] : (tensor<i32>) -> tensor<64x64xi32>
    %70 = stablehlo.add %arg2, %69 : tensor<64x64xi32>
    %71 = stablehlo.select %68, %70, %arg2 : tensor<64x64xi1>, tensor<64x64xi32>
    %72 = stablehlo.broadcast_in_dim %66, dims = [0] : (tensor<64xi32>) -> tensor<64x64xi32>
    %73 = stablehlo.broadcast_in_dim %72, dims = [0, 1] : (tensor<64x64xi32>) -> tensor<64x64x1xi32>
    %74 = stablehlo.broadcast_in_dim %71, dims = [0, 1] : (tensor<64x64xi32>) -> tensor<64x64x1xi32>
    %75 = stablehlo.concatenate %73, %74, dim = 2 : (tensor<64x64x1xi32>, tensor<64x64x1xi32>) -> tensor<64x64x2xi32>
    %76 = "stablehlo.gather"(%arg5, %75) <{dimension_numbers = #stablehlo.gather<offset_dims = [2, 3], collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = array<i64: 1, 1, 3, 8>}> : (tensor<2x2x3x8xf32>, tensor<64x64x2xi32>) -> tensor<64x64x3x8xf32>
    %77 = stablehlo.dot_general %76, %50, batching_dims = [0, 1] x [0, 1], contracting_dims = [3] x [2], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3x8xf32>, tensor<64x64x8xf32>) -> tensor<64x64x3xf32>
    %78 = stablehlo.dot_general %77, %61, batching_dims = [0, 1] x [0, 1], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3xf32>, tensor<64x64xf32>) -> tensor<64x64x3xf32>
    %79 = stablehlo.transpose %78, dims = [0, 2, 1] : (tensor<64x64x3xf32>) -> tensor<64x3x64xf32>
    %80 = stablehlo.transpose %arg0, dims = [0, 2, 1] : (tensor<64x64x3xf32>) -> tensor<64x3x64xf32>
    %81 = stablehlo.broadcast_in_dim %0, dims = [0, 2] : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %82 = stablehlo.broadcast_in_dim %81, dims = [0, 1, 2] : (tensor<64x1x64xf32>) -> tensor<64x3x64xf32>
    %83 = stablehlo.divide %80, %82 : tensor<64x3x64xf32>
    %84 = stablehlo.transpose %83, dims = [0, 2, 1] : (tensor<64x3x64xf32>) -> tensor<64x64x3xf32>
    %cst_5 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %85 = stablehlo.reduce(%79 init: %cst_5) applies stablehlo.add across dimensions = [2] : (tensor<64x3x64xf32>, tensor<f32>) -> tensor<64x3xf32>
    %86 = stablehlo.slice %85 [0:64, 0:1] : (tensor<64x3xf32>) -> tensor<64x1xf32>
    %87 = stablehlo.reshape %86 : (tensor<64x1xf32>) -> tensor<64xf32>
    %88 = stablehlo.slice %85 [0:64, 1:2] : (tensor<64x3xf32>) -> tensor<64x1xf32>
    %89 = stablehlo.reshape %88 : (tensor<64x1xf32>) -> tensor<64xf32>
    %90 = stablehlo.slice %85 [0:64, 2:3] : (tensor<64x3xf32>) -> tensor<64x1xf32>
    %91 = stablehlo.reshape %90 : (tensor<64x1xf32>) -> tensor<64xf32>
    %92 = stablehlo.dot_general %79, %84, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3x64xf32>, tensor<64x64x3xf32>) -> tensor<64x3x3xf32>
    %93 = stablehlo.slice %92 [0:64, 0:1, 0:3] : (tensor<64x3x3xf32>) -> tensor<64x1x3xf32>
    %94 = stablehlo.reshape %93 : (tensor<64x1x3xf32>) -> tensor<64x3xf32>
    %95 = stablehlo.slice %92 [0:64, 1:2, 0:3] : (tensor<64x3x3xf32>) -> tensor<64x1x3xf32>
    %96 = stablehlo.reshape %95 : (tensor<64x1x3xf32>) -> tensor<64x3xf32>
    %97 = stablehlo.dot_general %84, %79, batching_dims = [0, 1] x [0, 2], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3xf32>, tensor<64x3x64xf32>) -> tensor<64x64x3x3xf32>
    %98 = stablehlo.dot_general %97, %84, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3x3xf32>, tensor<64x64x3xf32>) -> tensor<64x3x3x3xf32>
    %99 = stablehlo.transpose %98, dims = [0, 2, 1, 3] : (tensor<64x3x3x3xf32>) -> tensor<64x3x3x3xf32>
    %100 = stablehlo.slice %99 [0:64, 0:1, 0:3, 0:3] : (tensor<64x3x3x3xf32>) -> tensor<64x1x3x3xf32>
    %101 = stablehlo.reshape %100 : (tensor<64x1x3x3xf32>) -> tensor<64x3x3xf32>
    %102 = stablehlo.slice %99 [0:64, 1:2, 0:3, 0:3] : (tensor<64x3x3x3xf32>) -> tensor<64x1x3x3xf32>
    %103 = stablehlo.reshape %102 : (tensor<64x1x3x3xf32>) -> tensor<64x3x3xf32>
    %104 = stablehlo.dot_general %84, %79, batching_dims = [0, 1] x [0, 2], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3xf32>, tensor<64x3x64xf32>) -> tensor<64x64x3x3xf32>
    %105 = stablehlo.dot_general %84, %84, batching_dims = [0, 1] x [0, 1], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3xf32>, tensor<64x64x3xf32>) -> tensor<64x64x3x3xf32>
    %106 = stablehlo.dot_general %105, %104, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3x3xf32>, tensor<64x64x3x3xf32>) -> tensor<64x3x3x3x3xf32>
    %107 = stablehlo.transpose %106, dims = [0, 4, 3, 2, 1] : (tensor<64x3x3x3x3xf32>) -> tensor<64x3x3x3x3xf32>
    %108 = stablehlo.slice %107 [0:64, 0:1, 0:3, 0:3, 0:3] : (tensor<64x3x3x3x3xf32>) -> tensor<64x1x3x3x3xf32>
    %109 = stablehlo.reshape %108 : (tensor<64x1x3x3x3xf32>) -> tensor<64x3x3x3xf32>
    %110 = stablehlo.dot_general %84, %79, batching_dims = [0, 1] x [0, 2], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3xf32>, tensor<64x3x64xf32>) -> tensor<64x64x3x3xf32>
    %111 = stablehlo.dot_general %84, %84, batching_dims = [0, 1] x [0, 1], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3xf32>, tensor<64x64x3xf32>) -> tensor<64x64x3x3xf32>
    %112 = stablehlo.dot_general %110, %84, batching_dims = [0, 1] x [0, 1], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3x3xf32>, tensor<64x64x3xf32>) -> tensor<64x64x3x3x3xf32>
    %113 = stablehlo.dot_general %112, %111, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x64x3x3x3xf32>, tensor<64x64x3x3xf32>) -> tensor<64x3x3x3x3x3xf32>
    %114 = stablehlo.transpose %113, dims = [0, 2, 1, 5, 4, 3] : (tensor<64x3x3x3x3x3xf32>) -> tensor<64x3x3x3x3x3xf32>
    %115 = stablehlo.slice %114 [0:64, 0:1, 0:3, 0:3, 0:3, 0:3] : (tensor<64x3x3x3x3x3xf32>) -> tensor<64x1x3x3x3x3xf32>
    %116 = stablehlo.reshape %115 : (tensor<64x1x3x3x3x3xf32>) -> tensor<64x3x3x3x3xf32>
    %117 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %118 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %119 = stablehlo.dot_general %117, %118, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %120 = stablehlo.convert %119 : (tensor<64xbf16>) -> tensor<64xf32>
    %121 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %122 = stablehlo.convert %89 : (tensor<64xf32>) -> tensor<64xbf16>
    %123 = stablehlo.dot_general %121, %122, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %124 = stablehlo.convert %123 : (tensor<64xbf16>) -> tensor<64xf32>
    %125 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %126 = stablehlo.convert %91 : (tensor<64xf32>) -> tensor<64xbf16>
    %127 = stablehlo.dot_general %125, %126, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %128 = stablehlo.convert %127 : (tensor<64xbf16>) -> tensor<64xf32>
    %129 = stablehlo.convert %94 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %130 = stablehlo.convert %94 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %131 = stablehlo.dot_general %129, %130, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3xbf16>, tensor<64x3xbf16>) -> tensor<64xbf16>
    %132 = stablehlo.convert %131 : (tensor<64xbf16>) -> tensor<64xf32>
    %133 = stablehlo.convert %94 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %134 = stablehlo.convert %96 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %135 = stablehlo.dot_general %133, %134, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3xbf16>, tensor<64x3xbf16>) -> tensor<64xbf16>
    %136 = stablehlo.convert %135 : (tensor<64xbf16>) -> tensor<64xf32>
    %137 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %138 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %139 = stablehlo.dot_general %137, %138, batching_dims = [0] x [0], contracting_dims = [1, 2] x [1, 2], precision = [DEFAULT, DEFAULT] : (tensor<64x3x3xbf16>, tensor<64x3x3xbf16>) -> tensor<64xbf16>
    %140 = stablehlo.convert %139 : (tensor<64xbf16>) -> tensor<64xf32>
    %141 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %142 = stablehlo.convert %103 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %143 = stablehlo.dot_general %141, %142, batching_dims = [0] x [0], contracting_dims = [1, 2] x [1, 2], precision = [DEFAULT, DEFAULT] : (tensor<64x3x3xbf16>, tensor<64x3x3xbf16>) -> tensor<64xbf16>
    %144 = stablehlo.convert %143 : (tensor<64xbf16>) -> tensor<64xf32>
    %145 = stablehlo.convert %109 : (tensor<64x3x3x3xf32>) -> tensor<64x3x3x3xbf16>
    %146 = stablehlo.convert %109 : (tensor<64x3x3x3xf32>) -> tensor<64x3x3x3xbf16>
    %147 = stablehlo.dot_general %145, %146, batching_dims = [0] x [0], contracting_dims = [1, 2, 3] x [1, 2, 3], precision = [DEFAULT, DEFAULT] : (tensor<64x3x3x3xbf16>, tensor<64x3x3x3xbf16>) -> tensor<64xbf16>
    %148 = stablehlo.convert %147 : (tensor<64xbf16>) -> tensor<64xf32>
    %149 = stablehlo.convert %116 : (tensor<64x3x3x3x3xf32>) -> tensor<64x3x3x3x3xbf16>
    %150 = stablehlo.convert %116 : (tensor<64x3x3x3x3xf32>) -> tensor<64x3x3x3x3xbf16>
    %151 = stablehlo.dot_general %149, %150, batching_dims = [0] x [0], contracting_dims = [1, 2, 3, 4] x [1, 2, 3, 4], precision = [DEFAULT, DEFAULT] : (tensor<64x3x3x3x3xbf16>, tensor<64x3x3x3x3xbf16>) -> tensor<64xbf16>
    %152 = stablehlo.convert %151 : (tensor<64xbf16>) -> tensor<64xf32>
    %153 = stablehlo.convert %89 : (tensor<64xf32>) -> tensor<64xbf16>
    %154 = stablehlo.convert %89 : (tensor<64xf32>) -> tensor<64xbf16>
    %155 = stablehlo.dot_general %153, %154, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %156 = stablehlo.convert %155 : (tensor<64xbf16>) -> tensor<64xf32>
    %157 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %158 = stablehlo.convert %120 : (tensor<64xf32>) -> tensor<64xbf16>
    %159 = stablehlo.dot_general %157, %158, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %160 = stablehlo.convert %159 : (tensor<64xbf16>) -> tensor<64xf32>
    %161 = stablehlo.convert %89 : (tensor<64xf32>) -> tensor<64xbf16>
    %162 = stablehlo.convert %120 : (tensor<64xf32>) -> tensor<64xbf16>
    %163 = stablehlo.dot_general %161, %162, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %164 = stablehlo.convert %163 : (tensor<64xbf16>) -> tensor<64xf32>
    %165 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %166 = stablehlo.convert %132 : (tensor<64xf32>) -> tensor<64xbf16>
    %167 = stablehlo.dot_general %165, %166, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %168 = stablehlo.convert %167 : (tensor<64xbf16>) -> tensor<64xf32>
    %169 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %170 = stablehlo.convert %136 : (tensor<64xf32>) -> tensor<64xbf16>
    %171 = stablehlo.dot_general %169, %170, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %172 = stablehlo.convert %171 : (tensor<64xbf16>) -> tensor<64xf32>
    %173 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %174 = stablehlo.convert %140 : (tensor<64xf32>) -> tensor<64xbf16>
    %175 = stablehlo.dot_general %173, %174, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %176 = stablehlo.convert %175 : (tensor<64xbf16>) -> tensor<64xf32>
    %177 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %178 = stablehlo.convert %148 : (tensor<64xf32>) -> tensor<64xbf16>
    %179 = stablehlo.dot_general %177, %178, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %180 = stablehlo.convert %179 : (tensor<64xbf16>) -> tensor<64xf32>
    %181 = stablehlo.convert %94 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %182 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %183 = stablehlo.dot_general %181, %182, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3xbf16>, tensor<64x3x3xbf16>) -> tensor<64x3xbf16>
    %184 = stablehlo.convert %183 : (tensor<64x3xbf16>) -> tensor<64x3xf32>
    %185 = stablehlo.convert %94 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %186 = stablehlo.convert %184 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %187 = stablehlo.dot_general %185, %186, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3xbf16>, tensor<64x3xbf16>) -> tensor<64xbf16>
    %188 = stablehlo.convert %187 : (tensor<64xbf16>) -> tensor<64xf32>
    %189 = stablehlo.convert %89 : (tensor<64xf32>) -> tensor<64xbf16>
    %190 = stablehlo.convert %132 : (tensor<64xf32>) -> tensor<64xbf16>
    %191 = stablehlo.dot_general %189, %190, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %192 = stablehlo.convert %191 : (tensor<64xbf16>) -> tensor<64xf32>
    %193 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %194 = stablehlo.convert %109 : (tensor<64x3x3x3xf32>) -> tensor<64x3x3x3xbf16>
    %195 = stablehlo.dot_general %193, %194, batching_dims = [0] x [0], contracting_dims = [1, 2] x [1, 2], precision = [DEFAULT, DEFAULT] : (tensor<64x3x3xbf16>, tensor<64x3x3x3xbf16>) -> tensor<64x3xbf16>
    %196 = stablehlo.convert %195 : (tensor<64x3xbf16>) -> tensor<64x3xf32>
    %197 = stablehlo.convert %94 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %198 = stablehlo.convert %196 : (tensor<64x3xf32>) -> tensor<64x3xbf16>
    %199 = stablehlo.dot_general %197, %198, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3xbf16>, tensor<64x3xbf16>) -> tensor<64xbf16>
    %200 = stablehlo.convert %199 : (tensor<64xbf16>) -> tensor<64xf32>
    %201 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %202 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %203 = stablehlo.dot_general %201, %202, batching_dims = [0] x [0], contracting_dims = [1] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x3x3xbf16>, tensor<64x3x3xbf16>) -> tensor<64x3x3xbf16>
    %204 = stablehlo.convert %203 : (tensor<64x3x3xbf16>) -> tensor<64x3x3xf32>
    %205 = stablehlo.convert %101 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %206 = stablehlo.convert %204 : (tensor<64x3x3xf32>) -> tensor<64x3x3xbf16>
    %207 = stablehlo.dot_general %205, %206, batching_dims = [0] x [0], contracting_dims = [1, 2] x [1, 2], precision = [DEFAULT, DEFAULT] : (tensor<64x3x3xbf16>, tensor<64x3x3xbf16>) -> tensor<64xbf16>
    %208 = stablehlo.convert %207 : (tensor<64xbf16>) -> tensor<64xf32>
    %209 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %210 = stablehlo.convert %160 : (tensor<64xf32>) -> tensor<64xbf16>
    %211 = stablehlo.dot_general %209, %210, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %212 = stablehlo.convert %211 : (tensor<64xbf16>) -> tensor<64xf32>
    %213 = stablehlo.convert %89 : (tensor<64xf32>) -> tensor<64xbf16>
    %214 = stablehlo.convert %160 : (tensor<64xf32>) -> tensor<64xbf16>
    %215 = stablehlo.dot_general %213, %214, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %216 = stablehlo.convert %215 : (tensor<64xbf16>) -> tensor<64xf32>
    %217 = stablehlo.convert %132 : (tensor<64xf32>) -> tensor<64xbf16>
    %218 = stablehlo.convert %120 : (tensor<64xf32>) -> tensor<64xbf16>
    %219 = stablehlo.dot_general %217, %218, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %220 = stablehlo.convert %219 : (tensor<64xbf16>) -> tensor<64xf32>
    %221 = stablehlo.convert %140 : (tensor<64xf32>) -> tensor<64xbf16>
    %222 = stablehlo.convert %120 : (tensor<64xf32>) -> tensor<64xbf16>
    %223 = stablehlo.dot_general %221, %222, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %224 = stablehlo.convert %223 : (tensor<64xbf16>) -> tensor<64xf32>
    %225 = stablehlo.convert %87 : (tensor<64xf32>) -> tensor<64xbf16>
    %226 = stablehlo.convert %188 : (tensor<64xf32>) -> tensor<64xbf16>
    %227 = stablehlo.dot_general %225, %226, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %228 = stablehlo.convert %227 : (tensor<64xbf16>) -> tensor<64xf32>
    %229 = stablehlo.convert %132 : (tensor<64xf32>) -> tensor<64xbf16>
    %230 = stablehlo.convert %132 : (tensor<64xf32>) -> tensor<64xbf16>
    %231 = stablehlo.dot_general %229, %230, batching_dims = [0] x [0], contracting_dims = [] x [], precision = [DEFAULT, DEFAULT] : (tensor<64xbf16>, tensor<64xbf16>) -> tensor<64xbf16>
    %232 = stablehlo.convert %231 : (tensor<64xbf16>) -> tensor<64xf32>
    %233 = stablehlo.broadcast_in_dim %87, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %234 = stablehlo.broadcast_in_dim %89, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %235 = stablehlo.broadcast_in_dim %91, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %236 = stablehlo.broadcast_in_dim %120, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %237 = stablehlo.broadcast_in_dim %124, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %238 = stablehlo.broadcast_in_dim %128, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %239 = stablehlo.broadcast_in_dim %132, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %240 = stablehlo.broadcast_in_dim %136, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %241 = stablehlo.broadcast_in_dim %140, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %242 = stablehlo.broadcast_in_dim %144, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %243 = stablehlo.broadcast_in_dim %148, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %244 = stablehlo.broadcast_in_dim %152, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %245 = stablehlo.broadcast_in_dim %156, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %246 = stablehlo.broadcast_in_dim %160, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %247 = stablehlo.broadcast_in_dim %164, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %248 = stablehlo.broadcast_in_dim %168, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %249 = stablehlo.broadcast_in_dim %172, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %250 = stablehlo.broadcast_in_dim %176, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %251 = stablehlo.broadcast_in_dim %180, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %252 = stablehlo.broadcast_in_dim %188, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %253 = stablehlo.broadcast_in_dim %192, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %254 = stablehlo.broadcast_in_dim %200, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %255 = stablehlo.broadcast_in_dim %208, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %256 = stablehlo.broadcast_in_dim %212, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %257 = stablehlo.broadcast_in_dim %216, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %258 = stablehlo.broadcast_in_dim %220, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %259 = stablehlo.broadcast_in_dim %224, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %260 = stablehlo.broadcast_in_dim %228, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %261 = stablehlo.broadcast_in_dim %232, dims = [0] : (tensor<64xf32>) -> tensor<64x1xf32>
    %262 = stablehlo.concatenate %233, %234, %235, %236, %237, %238, %239, %240, %241, %242, %243, %244, %245, %246, %247, %248, dim = 1 : (tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>) -> tensor<64x16xf32>
    %263 = stablehlo.concatenate %249, %250, %251, %252, %253, %254, %255, %256, %257, %258, %259, %260, %261, dim = 1 : (tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>, tensor<64x1xf32>) -> tensor<64x13xf32>
    %264 = stablehlo.concatenate %262, %263, dim = 1 : (tensor<64x16xf32>, tensor<64x13xf32>) -> tensor<64x29xf32>
    %265 = stablehlo.broadcast_in_dim %c_3, dims = [] : (tensor<i32>) -> tensor<64xi32>
    %266 = stablehlo.compare  LT, %arg1, %265,  SIGNED : (tensor<64xi32>, tensor<64xi32>) -> tensor<64xi1>
    %267 = stablehlo.broadcast_in_dim %c_4, dims = [] : (tensor<i32>) -> tensor<64xi32>
    %268 = stablehlo.add %arg1, %267 : tensor<64xi32>
    %269 = stablehlo.select %266, %268, %arg1 : tensor<64xi1>, tensor<64xi32>
    %270 = stablehlo.broadcast_in_dim %269, dims = [0] : (tensor<64xi32>) -> tensor<64x1xi32>
    %271 = "stablehlo.gather"(%arg3, %270) <{dimension_numbers = #stablehlo.gather<offset_dims = [1], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = array<i64: 1>}> : (tensor<2xf32>, tensor<64x1xi32>) -> tensor<64x1xf32>
    %272 = stablehlo.reshape %271 : (tensor<64x1xf32>) -> tensor<64xf32>
    %273 = stablehlo.dot_general %arg4, %264, contracting_dims = [0] x [1], precision = [DEFAULT, DEFAULT] : (tensor<29xf32>, tensor<64x29xf32>) -> tensor<64xf32>
    %274 = stablehlo.add %272, %273 : tensor<64xf32>
    return %274 : tensor<64xf32>
  }
  func.func private @norm(%arg0: tensor<64x64x3xf32>) -> tensor<64x64xf32> {
    %0 = stablehlo.multiply %arg0, %arg0 : tensor<64x64x3xf32>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %1 = stablehlo.reduce(%0 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<64x64x3xf32>, tensor<f32>) -> tensor<64x64xf32>
    %2 = stablehlo.sqrt %1 : tensor<64x64xf32>
    return %2 : tensor<64x64xf32>
  }
  func.func private @None(%arg0: tensor<64x64xf32>, %arg1: tensor<64x64xf32>, %arg2: tensor<64x64xf32>) -> (tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>) {
    %cst = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %0 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %1 = stablehlo.multiply %0, %arg0 : tensor<64x64xf32>
    %2 = stablehlo.multiply %1, %arg2 : tensor<64x64xf32>
    %3 = stablehlo.subtract %2, %arg1 : tensor<64x64xf32>
    return %arg2, %3, %arg2 : tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>
  }
  func.func private @atleast_2d(%arg0: tensor<64xf32>) -> tensor<1x64xf32> {
    %0 = stablehlo.broadcast_in_dim %arg0, dims = [1] : (tensor<64xf32>) -> tensor<1x64xf32>
    return %0 : tensor<1x64xf32>
  }
  func.func private @atleast_2d_0(%arg0: tensor<64x64xf32>) -> tensor<64x1x64xf32> {
    %0 = stablehlo.broadcast_in_dim %arg0, dims = [0, 2] : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    return %0 : tensor<64x1x64xf32>
  }
  func.func private @_where(%arg0: tensor<64x64xi1>, %arg1: tensor<64x64xf32>, %arg2: tensor<i32>) -> tensor<64x64xf32> {
    %0 = stablehlo.convert %arg2 : (tensor<i32>) -> tensor<f32>
    %1 = stablehlo.broadcast_in_dim %0, dims = [] : (tensor<f32>) -> tensor<64xf32>
    %2 = stablehlo.broadcast_in_dim %1, dims = [1] : (tensor<64xf32>) -> tensor<64x64xf32>
    %3 = stablehlo.select %arg0, %arg1, %2 : tensor<64x64xi1>, tensor<64x64xf32>
    return %3 : tensor<64x64xf32>
  }
  func.func private @_jax_calc_local_energy_1(%arg0: tensor<64x64x3xf32>, %arg1: tensor<64xi32>, %arg2: tensor<64x64xi32>, %arg3: tensor<2x2x3x8xf32>, %arg4: tensor<f32>, %arg5: tensor<f32>, %arg6: tensor<f32>) -> (tensor<64x64xf32>, tensor<64x3x64xf32>, tensor<64x64x3x8xf32>, tensor<64x64xf32>, tensor<f32>, tensor<64x64xf32>, tensor<6x64x64xf32>, tensor<64x64xf32>, tensor<64x64x3xf32>, tensor<f32>, tensor<64x64xf32>, tensor<64x64xi1>) {
    %0:2 = call @norm_2(%arg0) : (tensor<64x64x3xf32>) -> (tensor<64x64xf32>, tensor<64x64xf32>)
    %cst = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %1 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %2 = stablehlo.multiply %1, %0#0 : tensor<64x64xf32>
    %3 = stablehlo.add %arg5, %arg6 : tensor<f32>
    %4 = stablehlo.convert %3 : tensor<f32>
    %5 = stablehlo.broadcast_in_dim %4, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %6 = stablehlo.subtract %2, %5 : tensor<64x64xf32>
    %7 = stablehlo.subtract %arg6, %arg5 : tensor<f32>
    %8 = stablehlo.convert %7 : tensor<f32>
    %9 = stablehlo.broadcast_in_dim %8, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %10 = stablehlo.divide %6, %9 : tensor<64x64xf32>
    %cst_0 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %11 = stablehlo.broadcast_in_dim %cst_0, dims = [] : (tensor<f32>) -> tensor<64xf32>
    %12 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<64x64xf32>
    %13 = stablehlo.multiply %12, %10 : tensor<64x64xf32>
    %14 = stablehlo.broadcast_in_dim %11, dims = [1] : (tensor<64xf32>) -> tensor<64x64xf32>
    %cst_1 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %15 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<6x64x64xf32>
    %cst_2 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %16 = stablehlo.broadcast_in_dim %cst_2, dims = [] : (tensor<f32>) -> tensor<6x64x64xf32>
    %c = stablehlo.constant dense<0> : tensor<i32>
    %17:6 = stablehlo.while(%iterArg = %13, %iterArg_6 = %c, %iterArg_7 = %14, %iterArg_8 = %10, %iterArg_9 = %15, %iterArg_10 = %16) : tensor<64x64xf32>, tensor<i32>, tensor<64x64xf32>, tensor<64x64xf32>, tensor<6x64x64xf32>, tensor<6x64x64xf32>
     cond {
      %c_11 = stablehlo.constant dense<6> : tensor<i32>
      %85 = stablehlo.compare  LT, %iterArg_6, %c_11,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1>
      stablehlo.return %85 : tensor<i1>
    } do {
      %85:4 = func.call @None_3(%iterArg, %iterArg_7, %iterArg_8) : (tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>) -> (tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>)
      %86 = stablehlo.broadcast_in_dim %85#2, dims = [1, 2] : (tensor<64x64xf32>) -> tensor<1x64x64xf32>
      %c_11 = stablehlo.constant dense<0> : tensor<i32>
      %87 = stablehlo.dynamic_update_slice %iterArg_9, %86, %iterArg_6, %c_11, %c_11 : (tensor<6x64x64xf32>, tensor<1x64x64xf32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<6x64x64xf32>
      %88 = stablehlo.broadcast_in_dim %85#3, dims = [1, 2] : (tensor<64x64xf32>) -> tensor<1x64x64xf32>
      %89 = stablehlo.dynamic_update_slice %iterArg_10, %88, %iterArg_6, %c_11, %c_11 : (tensor<6x64x64xf32>, tensor<1x64x64xf32>, tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<6x64x64xf32>
      %c_12 = stablehlo.constant dense<1> : tensor<i32>
      %90 = stablehlo.add %iterArg_6, %c_12 : tensor<i32>
      stablehlo.return %iterArg, %90, %85#0, %85#1, %87, %89 : tensor<64x64xf32>, tensor<i32>, tensor<64x64xf32>, tensor<64x64xf32>, tensor<6x64x64xf32>, tensor<6x64x64xf32>
    }
    %18 = stablehlo.slice %17#4 [0:1, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %19 = stablehlo.transpose %18, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %20 = stablehlo.reshape %19 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %21 = stablehlo.slice %17#4 [1:2, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %22 = stablehlo.transpose %21, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %23 = stablehlo.reshape %22 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %24 = stablehlo.slice %17#4 [2:3, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %25 = stablehlo.transpose %24, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %26 = stablehlo.reshape %25 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %27 = stablehlo.slice %17#4 [3:4, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %28 = stablehlo.transpose %27, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %29 = stablehlo.reshape %28 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %30 = stablehlo.slice %17#4 [4:5, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %31 = stablehlo.transpose %30, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %32 = stablehlo.reshape %31 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %33 = stablehlo.slice %17#4 [5:6, 0:64, 0:64] : (tensor<6x64x64xf32>) -> tensor<1x64x64xf32>
    %34 = stablehlo.transpose %33, dims = [1, 0, 2] : (tensor<1x64x64xf32>) -> tensor<64x1x64xf32>
    %35 = stablehlo.reshape %34 : (tensor<64x1x64xf32>) -> tensor<64x64xf32>
    %36 = call @atleast_2d_4(%11) : (tensor<64xf32>) -> tensor<1x64xf32>
    %37 = stablehlo.transpose %36, dims = [1, 0] : (tensor<1x64xf32>) -> tensor<64x1xf32>
    %38 = call @atleast_2d_5(%10) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %39 = stablehlo.transpose %38, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %40 = call @atleast_2d_5(%20) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %41 = stablehlo.transpose %40, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %42 = call @atleast_2d_5(%23) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %43 = stablehlo.transpose %42, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %44 = call @atleast_2d_5(%26) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %45 = stablehlo.transpose %44, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %46 = call @atleast_2d_5(%29) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %47 = stablehlo.transpose %46, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %48 = call @atleast_2d_5(%32) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
    %49 = stablehlo.transpose %48, dims = [0, 2, 1] : (tensor<64x1x64xf32>) -> tensor<64x64x1xf32>
    %50 = call @atleast_2d_5(%35) : (tensor<64x64xf32>) -> tensor<64x1x64xf32>
